#### 🖌 Terraform Format and Style: `success`
#### ⚙️ Terraform Initialization: `success`
#### 🤖 Terraform Validation: `success`
#### 📖 Terraform Plan: `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.github_repo["go-btc-mayer-bot"].github_repository.repo: Refreshing state... [id=go-btc-mayer-bot]
module.github_repo["svelte-veribi-dashboard"].github_repository.repo: Refreshing state... [id=svelte-veribi-dashboard]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["go-dca-stat"].github_repository.repo: Refreshing state... [id=go-dca-stat]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]
module.github_repo["go-game-of-life"].github_repository.repo: Refreshing state... [id=go-game-of-life]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]
module.github_repo["goit"].github_repository.repo: Refreshing state... [id=goit]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["go-time-to-block"].github_repository.repo: Refreshing state... [id=go-time-to-block]
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["go-telegram-test"].github_repository.repo: Refreshing state... [id=go-telegram-test]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["go-mandel"].github_repository.repo: Refreshing state... [id=go-mandel]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["go-cci-trigger"].github_repository.repo: Refreshing state... [id=go-cci-trigger]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]
module.github_repo["veribi-cli"].github_repository.repo: Refreshing state... [id=veribi-cli]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["go-names"].github_repository.repo: Refreshing state... [id=go-names]
module.github_repo["dev-db-dockers"].github_repository.repo: Refreshing state... [id=dev-db-dockers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_repo["gout-black"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = false
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Search for black metal events in prague clubs"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Go"
      + has_downloads               = false
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "gout-black"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*